---
kind: enumMember
id: F:Autodesk.Revit.DB.ScheduleFieldType.ViewBased
enum: Autodesk.Revit.DB.ScheduleFieldType
source: html/9888db7d-00d0-4fd7-a1a9-cdd1fb5fce16.htm
---
# Autodesk.Revit.DB.ScheduleFieldType.ViewBased

A specialized type of field used for a few parameters whose
 displayed values can change based on the settings of the view: ROOM_AREA and ROOM_PERIMETER in room and space schedules. PROJECT_REVISION_REVISION_NUM in revision schedules. KEYNOTE_NUMBER in keynote legends that are numbered by sheet.